Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/vanhemmille.html.tmx
Source language: fin
Languages: sme

source: Vanhemmille
sme: Vánhemiidda

source: Kenelle kielipesä on tarkoitettu?
sme: Geasa giellabeassi lea dárkkuhuvvon?

source: Mitä kielipesä edellyttää perheeltä?
sme: Maid giellabeassi eaktuda bearrašis?

source: Miten kielipesä toimii?
sme: Mo giellabeassi doaibmá?

source: Miten lasten saamen kieli kehittyy?
sme: Mo mánáid sámegiella ovdána?

source: Miksi kielipesä?
sme: Manin giellabeassi?

source: Oletko kiinnostunut kielipesästä oman lapsesi mahdollisena varhaiskasvatusmuotona?
sme: Leatgo beroštuvvan giellabeasis iežat máná vejolaš árrabajásgeassinvuohkin?

source: Onko lapsesi kielipesässä ja etsit lisätietoa aiheesta?
sme: Leago du mánná juo giellabeasis ja ozat lassidieđuid fáttá birra?

source: Tälle sivulle on koottu kielipesälasten vanhempia koskevia kysymyksiä.
sme: Dán siidui leat čohkkejuvvon gažaldagat, mat gusket giellabeassemánáid vánhemiid.

source: Suomessa saamelaisten kulttuuri- ja kielipesätoiminta on tarkoitettu saamelaisperheiden alle kouluikäisille lapsille, jotka eivät pääse omaksumaan saamen kieltä kotonaan lainkaan tai riittävästi.
sme: Suomas sámiid kultur- ja giellabeassedoaibma lea dárkkuhuvvon sámebearrašiid vuollái skuvlaahkásaš mánáide, geat eai beasa oahppat sámegiela ruovttus olláge dahje doarvái.

source: Jos kielipesäryhmässä on tilaa, sinne voidaan joissakin tapauksissa ottaa myös muita kuin saamelaislapsia.
sme: Juos giellabeassejoavkkus lea sadji, dohko sáhttá muhtin dáhpáhusain váldit maiddái earágo sámemánáid.

source: Kielipesäryhmillä voi olla omia käytäntöjään sen suhteen, minkä ikäisiä lapsia ryhmään pääsee.
sme: Giellabeassejoavkkuin sáhttet leat iežaset vuogádagat dan ektui, man ahkásaš mánát jovkui besset.

source: Jos ryhmä on avoin kaikenikäisille, suositeltavaa on, että lapsi aloittaa kielipesän mahdollisimman varhain – heti, kun perhe tarvitsee lapselle varhaiskasvatuspaikkaa.
sme: Juos joavku lea rabas sierraahkásaččaide, ávžžuhuvvo, ahte mánná álggaha giellabeasi nu árrat go vejolaš – dalán, go bearaš dárbbaša mánnái árrabajásgeassinbáikki.

source: Tällöin lapsi kasvaa alusta saakka kaksikieliseksi.
sme: Dalle mánná šaddá álggu rájes guovttegielagin.

source: Erityisiä pääsyvaatimuksia kielipesään ei ole, eikä se edellytä lapselta tai perheeltä esimerkiksi kielellistä lahjakkuutta.
sme: Erenomáš sisabeassangáibádusat giellabeassái eai leat, iige dat eaktut mánás dahje bearrašis ovdamearkan gielalaš vitmatvuođa.

source: Muutamia selkeitä suosituksia perheille kuitenkin on:
sme: Moadde čielga ávžžuhusa bearrašiidda goittotge leat:

source: Perheen tulee sitoutua kielipesätoimintaan pitkällä tähtäimellä.
sme: Bearaš galgá čatnasit giellabeassedoibmii guhkit áigodahkii.

source: Kielipesä ei voi olla lyhytaikainen kokeilu tai väliaikaisratkaisu, vaan se tulee nähdä osana jatkumoa, jonka kautta lapselle pyritään luomaan koko elämänmittainen kieli- ja kulttuuriympäristö.
sme: Giellabeassi ii sáhte leat oanehis áigge geahččaleapmi dahje gaskaboddosaš čoavddus, muhto dan galgá oaidnit jotkkolašvuođa oassin, man bokte mánnái figgojuvvo fállot olles eallima guhkkosaš giella- ja kulturbiras.

source: Vanhempien on ymmärrettävä kielipesätoiminnan tavoitteet ja periaatteet ja kunnioitettava niitä.
sme: Vánhemat galget áddet giellabeassedoaimma ulbmiliid ja prinsihpaid ja gudnejahttit daid.

source: Perheen osallistuminen yhteiseen toimintaan on tärkeää.
sme: Bearraša oassálastin oktasaš doibmii lea dehálaš.

source: Jos mahdollista, lapsen tulisi päästä kielipesästä saamenkieliseen tai osittain saamenkieliseen kouluopetukseen.
sme: Juos vejolaš, mánná galggašii beassat giellabeasi maŋŋá sámegielat dahje muhtumassii sámegielat skuvlaoahpahussii.

source: Lapselle tulee pyrkiä tarjoamaan mahdollisimman paljon tukea saamen kielen käyttöön kielipesän ulkopuolella.
sme: Mánnái galgá geahččalit fállat nu olu go vejolaš doarjaga sámegiela geavaheapmái giellabeasi olggobealde.

source: Jos joku huoltajista osaa saamea, olisi hyvä ruveta puhumaan sitä lapselle.
sme: Juos gii nu fuolaheaddjiin máhttá sámegiela, livččii buorre hállagoahtit dan mánnái.

source: Lapselle voi hakea kielipesäpaikkaa, vaikkei kukaan kotona osaisi saamea.
sme: Mánnái sáhttá ohcat giellabeassebáikki, vaikke oktage ii ruovttus máhtášii hállat sámegiela.

source: On kuitenkin tavallista ja myös toivottavaa, että tällöin vanhemmat pyrkivät ainakin jossain määrin opettelemaan kieltä.
sme: Lea goittotge dábálaš ja maiddái sávahahtti, ahte dalle vánhemat geahččalit goittotge muhtin muddui oahpahallat giela.

source: Tähän on nykyään yhä paremmat mahdollisuudet, kun saamen kielten aikuisopetusta on tarjolla niin luokkahuone- kuin virtuaaliopetuksena, ja materiaaleja itseopiskeluunkin löytyy.
sme: Dasa leat dán áigge ain buoret vejolašvuođat, go sámegielaid rávesolmmošoahpahus lea fállun nu luohkkálatnja- go virtuálaoahpahussan, ja materiálat iehčanas stuđeremii gávdnojit.

source: Lapselle voi etsiä saamenkielisiä kontakteja, ja kotona voi hyödyntää saamenkielistä mediaa ja kulttuuritarjontaa.
sme: Mánnái sáhttá ohcat sámegielat kontávttaid, ja ruovttus sáhttá geavahit ávkin sámegielat media ja kulturfálaldaga.

source: Saamenkielisiä sukulaisia ja tuttavia kannattaa rohkaista puhumaan saamea lapsen kanssa.
sme: Gánneha roahkasmahttit sámegielat fulkkiid ja oahppásiid sámástit mánáin.

source: Myös lähipiirin positiivinen ja rohkaiseva asenne edistää lapsen kielenkehitystä!
sme: Maiddái lagašbirrasa positiivvalaš ja roahkasmahtti doaladupmi ovddida máná giellaovdáneami!

source: Lapsen tulee osallistua kielipesämuotoiseen varhaiskasvatukseen säännöllisesti ja riittävästi.
sme: Mánná galgá oassálastit giellabeassehápmásaš árrabajásgeassimii fásta ja doarvái olu.

source: Satunnainen varhaiskasvatuspaikan tarve sopii huonosti yhteen kielipesän periaatteiden ja tavoitteiden kanssa.
sme: Soaittáhat árrabajásgeassinbáikki dárbu heive funet oktii giellabeasi prinsihpaiguin ja ulbmiliiguin.

source: Tällöin lapsen kielenkehitys ei käynnisty toivotulla tavalla, ja hänellä voi myös olla sopeutumisvaikeuksia ryhmään.
sme: Dalle máná giellaovdáneapmi ii vuolgge johtui sávvojuvvon vugiin, ja sus sáhttet maiddái leat vuogáiduvvanváigatvuođat jovkui.

source: Koko kielipesäryhmän toiminta kärsii siitä, jos osa lapsista on paikalla vain harvoin eikä omaksu saamea samassa määrin muiden kanssa.
sme: Heailla giellabeassejoavkku doaibman gillá das, juos oassi mánáin lea báikki alde dušše hárve iige oahpa sámegiela seammá fárttain earáiguin.

source: Minimituntimäärä, joka saamenkielisessä kielipesässä tulisi viikossa viettää, on 25 h/vk.
sme: Minimadiibmomearri, man sámegielat giellabeasis galggašii leat vahkus, lea 25 h/vk.

source: Kielipesän toimintaperiaate on tiivistettynä se, että lapsille puhutaan aina yksinomaan saamen kieltä.
sme: Giellabeasi doaibmanprinsihpa sáhttá konkretiseret nu, ahte mánáide hállojuvvo álot dušše sámegiella.

source: Henkilöstö ei käytä heidän kanssaan suomea missään tilanteessa.
sme: Bargit eai geavat singuin suomagiela mange oktavuođas.

source: Ainoa poikkeus tästä voi olla tilanne, jossa lapsen terveys tai turvallisuus on uhattuna.
sme: Áidna spiehkastat dás sáhttá leat dilli, mas máná dearvvasvuohta dahje dorvvolašvuohta leat áitojuvvon.

source: Työntekijät puhuvat saamea myös keskenään, samoin kielipesäyhteyksissä kaikille muille aikuisille, jotka ymmärtävät saamea.
sme: Bargit hállet sámegiela maiddái gaskaneaset, ja maiddái sámástit giellabeasseoktavuođain buot eará rávesolbmuiguin, geat áddejit sámegiela.

source: Vanhempien tai esimerkiksi vieraiden kanssa puhutaan luonnollisesti suomea, jos he eivät osaa saamea.
sme: Vánhemiiguin dahje ovdamearkan gussiiguin hállojuvvo lunddolaččat suomagiella, juos sii eai máhte sámegiela.

source: Lapset saavat puhua sitä kieltä, mitä haluavat.
sme: Mánát ožžot hállat dan giela, maid háliidit.

source: Kun lasten valmiudet saamen kielen tuottamiseen kehittyvät, työntekijät pyrkivät rohkaisemaan ja auttamaan heitä saamen kielen käyttämisessä.
sme: Go mánáid válmmašvuođat sámegiela buvttadeapmái ovdánit, bargit geahččalit roahkasmahttit ja veahkehit sin sámegiela geavaheamis.

source: Erityisissä tilanteissa voidaan myös sopia, että suomea ei saa käyttää lainkaan – tällainen tilanne voi olla vaikkapa kielipesän ruokailu.
sme: Erenomáš diliin sáhttá maiddái soahpat, ahte suomagiela ii oaččo geavahit olláge – dakkár dilli sáhttá leat vaikkeba giellabeasi boradeapmi.

source: Näin voidaan kuitenkin toimia vain, jos käytäntö ei aiheuta lapsille ahdistusta.
sme: Ná sáhttá goittotge doaibmat dušše, juos geavat ii dagat mánáide áŧestusa.

source: Lasten hyvinvointi on kielipesässä, kuten yleensäkin varhaiskasvatuksesa aina ensimmäinen prioriteetti.
sme: Mánáid buresveadjin lea giellabeasis, nugo dábálaččatge árrabajásgeassimis álot vuosttas prioritehta.

source: Lasten passiivinen kielitaito eli kyky ymmärtää kieltä alkaa kehittyä kielipesässä hyvin nopeasti, heti ensihetkistä alkaen.
sme: Mánáid passiivvalaš gielladáidu dahjege nákca áddet giela álgá ovdánit giellabeasis hui johtilit, dalán álgomuttu rájes.

source: Aikuisen voi olla vaikea ymmärtää tätä prosessia, sillä lapsen kielellinen kapasiteetti ja joustavuus on aivan eri tasolla kuin meillä.
sme: Rávesolbmo sáhttá leat váttis áddet dán proseassa, dasgo máná gielalaš kapasitehta ja njuovžilvuohta leat áibbas sierra dásis go mis.

source: Kielipesässä kieli yhdistyy jatkuvasti konkreettisiin asioihin ja toimintaan, mikä tekee oppimisesta paljon tehokkaampaa kuin esimerkiksi sanojen ja kieliopin opettelu luokkahuoneessa paikallaan istuen.
sme: Giellabeasis giella laktása jotkkolaččat konkrehtalaš áššiide ja doaimmaide, mii bargá oahppamis olu beaktilut go ovdamearkan sániid ja giellaoahpa oahpahallan luohkkálanjas báikki alde čohkkámiin.

source: Kun lapsi kuulee saamenkielistä puhetta itselleen kiinnostavien leikkien, esineiden ja ihmisten yhteydessä, hän alkaa omaksua tätä sanastoa nopeasti.
sme: Go mánná gullá sámegielat hállama alcces miela miel stoahkamiid, dávviriid ja olbmuid oktavuođas, son álgá oahppat daid guoski sátneráju johtilit.

source: Työntekijät käyttävät puheen tukena paljon ei-sanallisia elementtejä: eleitä, ilmeitä, kehonkieltä, äänenpainoja ja kuvia.
sme: Bargit geavahit hállama doarjjan olu ii – sánálaš elemeanttaid: láhttagiid, geahčastagaid, lihkastagaid, jietnadeattuid ja govaid.

source: Kun lapsi kuulee ensimmäistä kertaa saameksi kehotuksen tulla pesemään käsiä, hän ei ymmärrä sanoja sinänsä.
sme: Go mánná gullá vuosttas háve sámegillii ávžžuhusa boahtit bassat gieđaid, son ii ádde sániid daninassii.

source: Sen sijaan hän näkee, miten työntekijä näin sanoessaan katsoo häntä ja hieroo käsiään yhteen käsienpesua elehtien.
sme: Muhto son oaidná, mo bargi ná dajadettiin geahččá su ja ruvve gieđaidis oktii nugo basašii gieđaid.

source: Samoin hän näkee, miten toiset lapset, jotka jo tietävät, mistä on kyse, lähtevät kohti käsienpesupaikkaa.
sme: Nugo maiddái son oaidná, mo nuppit mánát, geat juo dihtet, mas lea gažaldat, vulget gieđaid bassanbáikki guvlui.

source: Jos viesti ei vielä mene perille, työntekijä tulee lapsen luo, ottaa häntä kädestä kiinni ja vie käsienpesulle, samalla sanoittaen tilannetta: “no niin, katsohan, täällä pestään kädet, sinähän osaat jo varmasti pestä itse kätesi” – tämä tietenkin saameksi.
sme: Juos ášši ii vel áddejuvvo, bargi boahtá máná lusa, váldá su gieđas gitta ja doalvu gieđaid bassanbáikái, seammás hállamiin: “na de, geahčahan, dáppe sáhttá gieđaid bassat, donhan máhtát juo sihkkarit bassat ieš gieđaid” – dán dadjá dieđusge sámegillii.

source: Todennäköisesti seuraavalla kerralla lapsi jo tunnistaa käsienpesukehotuksessa jotakin tuttua, ja pian se on hänelle aivan selvä juttu.
sme: Oalle sihkkarit čuovvovaš háve mánná juo dovdá gieđaid bassanávžžuhusas man nu oahppása, ja fargga dat lea sutnje áibbas čielga ášši.

source: Tähän tapaan ymmärtäminen kehittyy kaikissa kielipesän päivittäisissä tilanteissa.
sme: Dán láhkai áddehallan ovdána giellabeasi buot beaivválaš doaimmain.

source: Muutaman kuukauden sisällä säännöllisessä kokopäivähoidossa ollut lapsi ymmärtää jo olennaisen sisällön siitä, mitä työntekijät kielipesässä puhuvat.
sme: Moatte mánotbaji siste fásta ollesbeaivedikšumis leamašan mánná ádde juo dehálaš sisdoalu das, maid bargit giellabeasis hállet.

source: Hän ei vielä ymmärrä läheskään jokaista sanaa, vaan nimenomaan kokonaisuuden.
sme: Son ii vel ádde lahkage juohke sáni, muhto namalassii oppalašvuođa.

source: Kielipesän ulkopuolella ja muiden ihmisten puhumana saamen kielen ymmärtäminen voi olla hänelle aluksi vaikeampaa.
sme: Giellabeasi olggobealde ja eará olbmuid hállan sámegiela ádden sáhttá leat sutnje álggos váddásut.

source: Lapsi saattaa tottua vahvasti nimenomaan kielipesän aikuisten puhumaan saameen – jokainenhan meistä puhuu vähän omalla tavallaan.
sme: Mánná sáhttá hárjánit nannosit namalassii giellabeasi rávesolbmuid hállan sámegillii – juohkehašhan mis hállá vehá iežas láhkai.

source: Tämä on yksi syy siihen, miksi on tärkeää, että lapsi kuulee mahdollisimman paljon erilaisten puhujien eri lailla puhumaa saamea.
sme: Dát lea okta sivva dasa, manin lea dehálaš, ahte mánná gullá nu olu go vejolaš iešguđetlágan hálliid sierra láhkai hállan sámegiela.

source: Saamenkielinen radio, lastenohjelmat, musiikki ja äänikirjat voivat tässäkin mielessä toimia kotona tärkeinä resursseina.
sme: Sámegielat rádio, mánáidprográmmat, musihkka ja jietnagirjjit sáhttet daninge doaibmat ruovttus dehálaš resursan.

source: Aktiivinen kielitaito kehittyy kielipesälapsilla huomattavasti hitaammin kuin passiivinen, ja erot eri lasten välillä ovat hyvin suuria.
sme: Aktiivvalaš gielladáidu ovdána giellabeassemánáin čielgasit hihtásabbot go passiivvalaš dáidu, ja erohusat sierra mánáid gaskkas leat hui stuorrát.

source: Miksi samassa ryhmässä yksi lapsi saattaa alkaa puhua saamea muutamassa viikossa, ja toinen ei vielä useammassakaan vuodessa?
sme: Manin seammá joavkkus okta mánná sáhttá hállagoahtit sámegiela moatti vahkus, ja nubbi ii vel máŋgga jagisge?

source: Koska lapset ovat yksilöitä, joiden kiinnostuksenkohteet, kielellinen kapasiteetti, sosiaalinen suuntautuminen, tarpeet ja pyrkimykset ovat yksilöllisiä.
sme: Go mánát leat ovttaskas olbmot, geaid beroštumit, gielalaš kapasitehta, sosiálalaš doaibman, dárbbut ja figgamušat leat oktagaslaččat.

source: Se, kuinka paljon lapsi kuulee saamen kieltä kielipesän ulkopuolella, voi vaikuttaa aktiivisen kielitaidon kehittymiseen.
sme: Dat, man olu mánná gullá sámegiela giellabeasi olggobealde, sáhttá váikkuhit aktiivvalaš gielladáiddu ovdáneapmái.

source: On kuitenkin mahdollista, että aivan samoissa oloissa kasvavien, saman perheen lasten kielellinen kehitys on aivan erilaista.
sme: Lea goittotge vejolaš, ahte áibbas seammá eallindiliin šaddan, seammá bearraša mánáid gielalaš ovdáneapmi lea áibbas earálágan.

source: Lapsen kaksikielistyminen on pitkä prosesi, joka ei aina mene juuri niin kuin esimerkiksi vanhemmat haluaisivat.
sme: Máná šaddan guovttegielagin lea guhkes proseassa, mii ii álot mana justa nugo ovdamearkan vánhemat háliidivčče.

source: Jos sinusta tuntuu, että lapsesi ei millään puhu saamea, vaikka saman ryhmän muut lapset puhuvat, älä hätiköi!
sme: Juos du mielas orru, ahte du mánná ii moktege hála sámegiela, vaikke seammá joavkku eará mánát hállet, ale heađástuva!

source: Lapsessasi ei luultavasti ole mitään vikaa, hänen kielenoppimisprosessinsa vain menee eri tahtiin kuin jollakulla muulla.
sme: Mánástat ii jáhkkimis leat mihkkige vigiid, su giellaoahppanproseassa dušše manná eará fárttain go geas nu earás.

source: Prosessi on silti koko ajan käynnissä.
sme: Proseassa lea liikká geažos áigge jođus.

source: Toki jos vanhemmat ovat huolissaan lapsen kielenkehityksestä tai epäilevät kielellisiä vaikeuksia, asiasta kannattaa puhua kielipesässä ja lasten kielenkehitystä tuntevien tahojen kanssa.
sme: Nappo juos vánhemat leat fuolas máná giellaovdáneamis dahje navddát gielalaš váttisvuođaid, ášši birra gánneha hállat giellabeasis ja mánáid giellaovdáneami dovdi olbmuiguin.

source: Jos taas on niin, että kielipesäryhmän kaikkien lasten kieli jää moneksi vuodeksi passiiviselle tasolle, ryhmässä ei todennäköisesti ole kaikki kunnossa.
sme: Juos fas lea nu, ahte giellabeassejoavkku buot mánáid giella báhcá máŋgga jahkái passiivvalaš dássái, joavkkus ii jáhkkimis leat buot ortnegis.

source: Aktiivinen puheen tuottaminen käynnistyy kielipesälapsilla usein seuraavissa vaiheissa: 1. toistaminen: lapsi toistaa aikuisten käyttämiä saamenkielisiä sanoja ja lyhyitä fraaseja 2. yksittäisten saamenkielisten sanojen käyttäminen: lapsi alkaa käyttää saamen sanoja suomen kielen seassa, esimerkiksi “tämä ei ole minun kappeer* ” (*inarinsaamea: lakki) 3. saamen- ja suomenkielisen aineksen yhdistyminen lausetasolla, esimerkiksi “minä haluan čierâstiđ ruopsis pulkkurijn* sinun kanssa” (*inarinsaamea: laskea punaisella pulkalla) 4. kokonaisten saamenkielisten lauseiden tai pääasiassa saamenkielistä ainesta sisältävien lauseiden tuottaminen.
sme: Aktiivvalaš hállama buvttadeapmi álgá giellabeassemánáin dávjá čuovvovaš muttuin: 1. jievžan: mánná jievžá rávesolbmuid geavahan sámegielat sániid ja oanehis frásaid 2. ovttaskas sámegielat sániid geavaheapmi: mánná geavahišgoahtá sámegiela sániid suomagiela seagas, ovdamearkan “tämä ei ole minun kappeer* ” (*anárašgiella: gahpir) 3. sáme- ja suomagielat sániid ovttastuvvan cealkkadásis, ovdamearkan “minä haluan čierâstiđ ruopsis pulkkurijn* sinun kanssa” (*anárašgiella: čierastit rukses bulkoriin) 4. sámegielat olles cealkagiid dahje váldoáššis sámegielat sániid sisttisdoalli cealkagiid buvttadeapmi.

source: Joskus vanhemmat tai ulkopuoliset aikuiset saattavat huolestua siitä, että lapsi puhuu sekaisin suomea ja saamea.
sme: Muhtumin vánhemat dahje olggobeale rávesolbmot sáhttet fuolastuvvat das, ahte mánná hállá seahkalagaid suomagiela ja sámegiela.

source: Tämä on kuitenkin päin vastoin hyvä merkki lapsen kielen kehityksestä ja normaali osa kaksikielistymistä!
sme: Dát lea baicce buorre mearka máná giela ovdáneamis ja normála oassi guovttegielagin šaddamis!

source: Sama pätee siihen, jos lapsi taivuttaa saamen kielen sanoja suomen kielen taivutusopin mukaan tai toisin päin.
sme: Seammá guoská dasa, juos mánná sojaha sámegiela sániid suomagiela sojahanoahpa mielde dahje nuppe gežiid.

source: On aivan tavallista, että lapsi käyttää suomenkielisiä sanoja sittenkin, kun osaa jo puhua saamea kokonaisin lausein.
sme: Lea áibbas dábálaš, ahte mánná geavaha suomagielat sániid dallege, go máhttá juo sámástit olles cealkagiin.

source: Kaksi- ja monikieliset ihmiset nappaavat usein omasta kielivarannostaan sen sanan, joka ensimmäisenä tulee mieleen.
sme: Guovtte- ja máŋggagielat olbmot dohppejit dávjá iežaset sátnerájus dan sáni, mii vuosttasin boahtá millii.

source: Isompaa lasta voi toki opastaa siihen, että tämä jaksaisi nähdä vaivaa tai odottaa hetken hakeakseen mieleensä sen sijaan vastaavan saamen sanan.
sme: Stuorát máná sáhttá nappo rávvet dasa, ahte son veajášii bargat dan ovdii dahje vuorddestit vehá smiehttan dihtii vástideaddji sámesáni.

source: Se, miten lapsi – tai aikuinenkaan – puhuu saamea, liittyy myös kielen yleiseen tilanteeseen, elinvoimaisuuteen, asemaan yhteisössä, ympäristön asenteisiin, kielen käyttöyhteyksien laajuuteen jne. Kielipesälapsen saamenkielinen sanasto on muiden saamenkielisten, pääasiassa aikuisten varassa.
sme: Dat, mo mánná – dahje rávesolmmoš – hállá sámegiela, laktása maiddái giela almmolaš dillái, eallinfápmui, sajádahkii servošis, birrasa doaladumiide, giela geavahanoktavuođaid viidodahkii jna. Giellabeassemáná sámegielat sátnerádju lea eará sámegielat olbmuid, váldoáššis rávesolbmuid veagas.

source: Jos hänelle ei ole koskaan puhuttu saameksi tietystä aiheesta, hänellä ei ole sanastoa puhuakseen siitä saameksi.
sme: Juos sutnje ii leat goassige hállojuvvon sámegillii dihto fáttás, sus ii leat sátnerádju mainna hállat dan birra sámegillii.

source: Kielipesien työntekijöiden täytyy antaa lapsille niin paljon kielellistä ainesta kuin mahdollista, eli toisin sanoen puhua heille mahdollisimman paljon.
sme: Giellabesiid bargit fertejit fállat mánáide nu olu gielalaš ávdnasiid go vejolaš, dahjege nuppiid sániiguin hállat sidjiide nu olu go vejolaš.

source: Toimintaa on myös suunniteltava siltä kannalta, että lapset pääsevät kokemaan saamen kielellä mahdollisimman monenlaisia aiheita ja asioita.
sme: Doaimma galgá maiddái plánet dan dáfus, ahte mánát besset vásihit sámegillii nu máŋggalágan fáttáid ja áššiid go vejolaš.

source: On hyvin tavallista, että lapset puhuvat kielipesässä keskenään suomen kieltä.
sme: Lea hui dábálaš, ahte mánát hállet giellabeasis gaskaneaset suomagiela.

source: Sellaisetkin lapset, jotka puhuvat aktiivisesti saamea kielipesän aikuisille, saattavat leikkiä keskenään aina suomeksi.
sme: Dakkárge mánát, geat hállet aktiivvalaččat sámegiela giellabeasi rávesolbmuide, sáhttet stoahkat gaskaneaset álot suomagillii.

source: Toki on myös lapsia, jotka käyttävät keskenään kumpaakin kieltä tai yksinomaan saamea.
sme: Nappo leat maiddái mánát, geat geavahit gaskaneaset goappáge giela dahje dušše sámegiela.

source: Kielenvalinta liittyy kielen yleiseen tilanteeseen.
sme: Giellaválljen laktása giela almmolaš dillái.

source: Saamenkielisten kielipesien lapset ovat tottuneet siihen, että enemmistö heidän tuntemistaan lapsista puhuu suomea, heidän kotikielenään on usein yksinomaan suomi, ja esimerkiksi lastenkulttuuri heidän ympärillään on pitkälti suomenkielistä.
sme: Sámegielat giellabesiid mánát leat hárjánan dasa, ahte eanetlohku sin dovdan mánáin hállá suomagiela, sin ruovttugiellan lea dávjá dušše suomagiella, ja ovdamearkan mánáidkultuvra sin birra lea buorre muddui suomagielat.

source: Me aikuiset voimme tietoisesti päättää, että puhumme keskenämme saamea, koska pidämme sitä tärkeänä, ja se onkin yksi saamen kielten elpymisen kannalta välttämättömistä valinnoista.
sme: Mii rávesolbmot sáhttit diđolaččat mearridit, ahte sámástit gaskaneamet, danin go atnit dan dehálažžan, ja dat leage sámegielaid ealáskahttima dáfus okta daid vealtameahttun válljemiin.

source: Lapset toimivat kuitenkin harvoin tällaisten arvovalintojen pohjalta.
sme: Mánát doibmejit goittotge hárve dákkár árvoválljemiid vuođul.

source: Lapsia ei voi pakottaa, eikä “puhukaapa saamea!
sme: Mánáid ii sáhte bágget, iige “hállet dal sámegiela!

source: ” -tyyppinen puuttuminen lasten leikkeihin ole pitemmän päälle hedelmällistä.
sme: ” -tiippalaš reageren mánáid stoahkamiidda ii guhkit áiggis leat mávssolaš.

source: Tilanteeseen voi vaikuttaa parhaiten sillä, että henkilöstö osallistuu lasten leikkeihin mahdollisimman paljon.
sme: Dillái sáhttá váikkuhit buoremusat nu, ahte bargoveahka oassálastá mánáid stoahkamiidda nu olu go vejolaš.

source: Saamenkielisen aikuisen läsnäolo johtaa usein siihen, että lapset puhuvat tilanteessa saamea myös toisilleen.
sme: Sámegielat rávesolbmo báikki alde orrun duvdá dan, ahte mánát hállet sámegiela maiddái nuppiide.

source: Toinen keino on kielellisen mallin antaminen niin, että lapsille mieluisia leluja, pelejä jne. käytetään mahdollisimman paljon myös yhteisissä toiminnoissa.
sme: Nubbi vuohki lea gielalaš málle addin nu, ahte mánáide miela miel duhkorasat, spealut jna. geavahuvvojit nu olu go vejolaš maiddái oktasaš doaimmain.

source: Kun lapset saavat aikuiselta saamenkielisen mallin vaikkapa autoradalla leikkimiseen, he saattavat helpommin puhua saamea autoradalla leikkiessään myöhemminkin, kun aikuinen ei ole mukana.
sme: Go mánát ožžot rávesolbmos sámegielat málle vaikkeba biilaraŧiin stoahkamis, sii sáhttet álkibut hállat sámegiela biilaraŧiin stoagadettiin maŋŋáge, go rávesolmmoš ii leat mielde.
